# ===========================================
# # 2.2

# Здравствуй, мир!
# print('Здравствуй, мир!')

# Счастливая последовательность 1
# print("4", "8", "15", "16", "23", "42")

# Счастливая последовательность 2
# print("4")
# print("8")
# print("15")
# print("16")
# print("23")
# print("42")

# Звёздный треугольник ⭐
# print("*")
# print("**")
# print("***")
# print("****")
# print("*****")
# print("******")
# print("*******")

# Приветствие 👋
# name = input()
# print('Привет,', name)

# Любимая команда
# name=input()
# print(name, "- чемпион!")

# Повторяй за мной 🔁
# a=input()
# b=input()
# c=input()
# print(a)
# print(b)
# print(c)

# Повторяй за мной 2 🔁
# a=input()
# b=input()
# c=input()
# print(c)
# print(b)
# print(a)

# ===========================================
# 2.3

# I like Python 🐍
# print('I', 'like', 'Python', sep='***')

# Поприветствуй ✋
# name = input()
# print('Привет,', name, end='!')

# Кастомный разделитель
# razd = input()
# a = input()
# b = input()
# c = input()
# print(a, b, c, sep=razd)

# ===========================================
# 2.4

# Задача - Три последовательных числа
# Напишите программу вывода на экран трех последовательно идущих чисел, каждое на отдельной строке. Первое число вводит пользователь, остальные числа вы должны сами вычислять в программе.
#
# Формат входных данных
# На вход программе подаётся одно целое число.
#
# Формат выходных данных
# Программа должна вывести три последовательно идущих числа в соответствии с условием задачи.
#
# Подсказка
# Пусть a, b, c – наши последовательные числа. Тогда переменные b и c должны вычисляться на основе переменной a:

# Решение
# a = int(input())
# print(a)
# print(a+1)
# print(a+2)